# SingleServerService Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SingleServerService Class
Members See Also
---
This class represents a single-server service inside Revit application. It is created when an instance of ISingleServerService is registered with Revit.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class SingleServerService : ExternalService
```

Visual Basic
---
```text
Public Class SingleServerService _
	Inherits ExternalService
```

Visual C++
---
```text
public ref class SingleServerService : public ExternalService
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.ExternalService..::..ExternalService Autodesk.Revit.DB.ExternalService..::..SingleServerService
# See Also
SingleServerService Members
Autodesk.Revit.DB.ExternalService Namespace